Revit 2016 API
BuiltInFailures.SketchFailures.BentFabricSheetManyLoopsInSketch Property
 Bend profile contains more than one loop. Cannot create a bent fabric sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public static FailureDefinitionId BentFabricSheetManyLoopsInSketch { get; }
Visual Basic
Public Shared ReadOnly Property BentFabricSheetManyLoopsInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BentFabricSheetManyLoopsInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace